# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"

# Packages
brew "fish"
brew "fisher"
brew "git"
brew "gh"
brew "mas"
brew "micro"
brew "python3"
brew 'svn' # Required for fonts
brew 'terminal-notifier'

# Applications
cask "brave-browser"
cask "docker"
cask "figma"
cask "firefox-developer-edition"
cask "google-drive"
cask "microsoft-office"
cask "postman"
cask "sizzy"
cask "visual-studio-code"

# Fonts
cask "font-fira-code"
cask "font-jetbrains-mono-nerd-font"

# Mac App Store
mas "Bitwarden", id: 1352778147
mas "Broadcasts", id: 1469995354
mas "CleanMyMac X", id: 1339170533
mas "The Unarchiver", id: 425424353
mas "Spark – Email App by Readdle", id: 1176895641